<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>

<meta http-equiv="content-type" content="text/html; charset=iso-8859-1" />
<meta name="description" content="description" />
<meta name="keywords" content="keywords" />
<meta name="author" content="author" />
<meta http-equiv="content-type" content="text/html; charset=iso-8859-1" />
<meta name="description" content="description" />
<meta name="keywords" content="keywords" />
<meta name="author" content="author" />

<link rel="Stylesheet" href="../css/style.css" type="text/css" media="screen" />
<link rel="Stylesheet" href="../css/projekte.css" type="text/css" media="screen" />


<title>Kompetenzfeld Media, Netze und Mobile Computing</title>

</head>
                                                         
<body>

<div class="main">

	<div class="main_left">
			<div class="link_menu">
				<a href="../index.html" accesskey="1">Home</a>
				<a href="../aktivitaeten.html" accesskey="6">Unsere Aktivit&auml;ten</a>
				<a href="../projekte.html" accesskey="4">Projekte</a>
				<a href="../publikationen.html" accesskey="4">Publikationen und Vortr&auml;ge</a>
				<a href="../team.html" accesskey="7">Das Team</a>
				<a href="../impressum.html" accesskey="3">Impressum</a>
			</div><!--link_menu-->
	
			<div class="logo"></div>
			
			<div class="Sprache">
				<a href="../en/Projekte/alt_musical.html"><img src="../img/englisch.gif" border="0" width="16" height="11"></a>
				<a href="alt_musical.html"><img src="../img/deutsch.gif" border="0"  width="16" height="11"></a>
			</div>
			
			<div class="subnavi">

				<div class="lbl">Laufende Projekte</div>

					<ul class="menu_2">
						<li>
							<a href="../projekte.html">
							<strong class="h2">Infrastruktur-/ Forschungsprojekte</strong><br />
							<strong class="h3">durch Drittmittel gef&ouml;rderte Projekte</strong>
							</a>
						</li>
						<li>
							<a href="kurse.html">
							<strong class="h2">Aus- und Weiterbildungskurse</strong><br />
							<strong class="h3">durch Drittmittel gef&ouml;rderte Kurse</strong>
							</a>
						</li>
						<li>
							<a href="zusammenarbeit.html">
							<strong class="h2">Zusammenarbeit</strong><br />
							<strong class="h3">Interdisziplin&auml;re Zusammenarbeit</strong>
							</a>
						</li>
					</ul>
					
				<div class="lbl">Abgeschlossene Projekte</div>
					
					<ul class="menu_2">	 
						 <li>
							<a href="alte_Projekte.html">
							<strong class="h2">Abgeschlossene Projekte</strong><br />
							<strong class="h3">&auml;ltere Projekte und Kurse</strong>
							</a>
						</li>
					</ul>
 			 </div><!--subnavi-->
 		</div><!--main_left-->


		<div class="main_right">

			<div class="header" style="background-image: url('../img/header_projekte.jpg')">
			</div>

			<div class="content">
				<h1>Abgeschlossene Projekte und Kurse</h1>
				
				<div class="descr">Abgeschlossene Projekte/ Kurse mit Unterst&uuml;tzung durch Fremdmittel</div>
				
				<div class="spacer_big"></div>
							
<!--***********************************************************************************************************-->
<!--***********************************************************************************************************-->
					
					<a href="alte_Projekte.html">&lt;zur&uuml;ck zur &Uuml;bersicht</a>	
					
					<h2>Musical / Notebookuniversity Teilprojekt Mobile Videokonferenzen</h2>
					
					
					<p>
						<i>Auszug aus dem Abschlussbericht</i>
					</p>
					
					<h3>Die zugrunde liegende Technik</h3>
					
					<p>
						Das digitale Audio-Video/Media Konferenzsystem daViKo [1] das in diesem Projekt eingesetzt wird ist eine propriet&auml;r entwickelte serverlose mehrpunktf&auml;hige Videokonferenzsoftware ohne zentrale Mehrfach-Konferenzeinheit (MCU). Es ist als Peer-to-Peer-Modell entworfen, und gedacht als Konferenzsystem das wie E-Mail zu benutzen ist. Dies bedeutet allerdings, dass das System nicht zum H323 Standard [3] konform ist.
					</p>
				
					<p>
						Kernkomponente des Systems ist ein schneller, hoch effizienter wavelet-basierter Videokompressionscodec. Durch geeignete Steuerparameter kann die zugeh&ouml;rige Kommunikationssoftware im laufenden Betrieb auf Bandbreiten von 64 bis 4000 kBit/s eingestellt werden. Die Audiodaten werden mit einem MP3 Algorithmus komprimiert. Audio und Videodaten k&ouml;nnen sowohl &uuml;ber unicast als auch multicast - Protokoll &uuml;bertragen werden.
					</p>
					
					<p>
						Zus&auml;tzlich ist in das System auch noch ein Application Sharing Modul integriert, das gemeinsames Arbeiten und Teleteaching erm&ouml;glicht. Das System ist besonders geeignet f&uuml;r Intranetanwendungen bzw. drahtlos verbundene Videokonferenzen, da die notwendige minimale &uuml;bertragungsbandbreite 64 Kbit/s betr&auml;gt und die Audio-/Videoqualit&auml;t an die verf&uuml;gbare Bandbreite angepasst werden kann. F&uuml;r kleinere verf&uuml;gbare Bandbreiten kann der Videostrom auch abgeschaltet werden. Das heiﬂt jeder einzelne Teilnehmer kann je nachverf&uuml;gbarer Bandbreite 4 verschiedene Modi w&auml;hlen: 1.nur h&ouml;ren, 2.h&ouml;ren und sprechen, 3.h&ouml;ren und sehen oder 4.h&ouml;ren, sehen und Video senden in verschiedener Qualit&auml;t. Diese Modi k&ouml;nnen im laufenden Betrieb umgeschaltet werden.
					</p>
					
					<h3>WLAN Betrieb an der FHTW</h3>
					
					<p>
						Das in 1. beschriebene Video/Media- Kommunikationssystem wurde installiert und im mobilen 802.11b WLAN Einsatz getestet. Das Problem beim WLAN Einsatz von Videokommunikation ist, dass die Teilnehmer die an einem gemeinsamen Accesspoint ankoppeln sich die Bandbreite von max. 11 Mb/s teilen m&uuml;ssen. Bei einer solchen Technik erwies es sich als sinnvoll, dass nur der Lehrende immer voll per Video zu sehen und zu h&ouml;ren war, w&auml;hrend die anderen Teilnehmer (d.h. die Studierenden) nur bei Bedarf oder nach Aufforderung von ihrem Videosendekanal Gebrauch machten.
					</p>
					
					<p>
						Es wurden neben dem 802.11b WLAN Standard auch 802.11g WLAN eingesetzt wo eine max. Bandbreite von 54 MB/s zur Verf&uuml;gung steht. Dabei sind bis zu 7 Notebooks &uuml;ber einen 802.11g WLAN Accesspoint in einer vollen peer-to-peer Videokonferenz  zum Einsatz gekommen, d.h. jeder Konferenzteilnehmer konnte jeden sehen (im QCIF Videobild Format 176x144 Pixel) und in guter Audioqualit&auml;t h&ouml;ren.
					</p>
					
					<h3>Realisierte Lernszenarien</h3>
					
					<p>
						Neben den Videokonferenz / Broadcast - Szenarien mit den erw&auml;hnten bekannten Bandbreitenproblemen, hat sich ein reduziertes Szenario als n&uuml;tzlich erwiesen. Wenn alle Teilnehmer in einem Raum sind, ist es sinnvoll die Powerpointfolien oder anderen PC-basierten Lernmaterialien des Vortragenden mit Hilfe der Applicationsharing -Funktion live per WLAN direkt zu den Teilnehmernotebooks zu schicken.  Dies erh&ouml;ht die Lesbarkeit und Lerneffektivit&auml;t im Vergleich zu mit Beamern zentral projizierten Materialien erheblich. Dar&uuml;ber hinaus k&ouml;nnen die Teilnehmer selbst eigene Folien an die anderen Beteiligten und damit auch an den zentralen Beamer schicken (verteiltes Pr&auml;sentieren).
					</p>
					
					<p>
						Es gibt auch die M&ouml;glichkeit eines asynchronen verteilten Lernszenarios, d.h. jede teilnehmende Station (Notebook oder  PC im LAN) kann die Sitzung aufzeichnen.In der Praxis wird dann ein Tutor oder ein Student die Aufzeichnung steuern. Damit wird der Vortragende von der Bedienung der  Aufnahmebedientechnik entlastet .
					</p>
					
					
					<h3>Asyonchrones Lernen</h3>
					
					<p>
						Die Daten einer Vorlesung werden von einer in der Konferenz geschalteten Station  in einem propriet&auml;ren Format gespeichert. Die aufgezeichneten Audio/Video/Media Daten werden dann in ein Microsoft-Streaming Format transkodiert und auf einem Streaming-Server bereitgestellt und in der Lernplattform Clix verlinkt. Sie k&ouml;nnen dann von Clix als Web-basiertes Videostreaming zusammen mit den PC-Applicationen jederzeit im Internet &uuml;ber Windows-kompatible Browser abgerufen werden. 
					</p>
					
					<p>
						Mit Hilfe einer geeignet skalierten Version kann das gesamte Lehr- und Lernmaterial auch auf  WLAN f&auml;higen PDAs abgespielt werden. Dies erweitert die Mobilit&auml;t der passiven Teilnehmer betr&auml;chtlich.
					</p>
					
					<img src="pics/alt_musical_netzwerk.jpg" alt="" />
					
					
					<h3>Fazit</h3>
					
					<ul>
						<li>Es wurde ein Videokonferenzsystem installiert, das &uuml;ber WLAN Campusweit in der FHTW einsetzbar ist.</li>
						<li>Das System wurde im Laufe des Projektes  in einzelnen Vorlesungen eingesetzt.</li>
						<li>Es wurde Video basierter Content in verschiedenen Varianten erzeugt</li>
						<li>Es wurden Experimente zur Mobilit&auml;t bei Videosessions durchgef&uuml;hrt</li>
					</ul>
					
					<h3>Schwierigkeiten und Probleme</h3>
					
					<ul>
						<li>Probleme mit den Audio-Einstellungen. Bei der &uuml;bertragung von Application Sharing kann es zu kurzen  Audiost&ouml;rungen kommen.</li>
						<li>Bandbreitenprobleme treten auf wenn mehr als 6 Teilnehmer vollen 2 Weg- Videokonferenzbetrieb machen. Dies bedingt dass die Zahl der Teilnehmer mit vollem R&uuml;ckkanal begrenzt  wird auf die jeweils aktiven. Alle anderen Teilnehmer empfangen nur Audio und Applicationsharingdaten.</li>
						<li>Nicht alle studentischen Teilnehmer waren bei den Veranstaltungen im Besitz eines WLAN f&auml;higen Notebooks.</li>
					</ul>
					
					<h3>Vorteile des Systems</h3>
					
					<p>
						Einfache Handhabung mit geringem Aufwand an Hardware. Der Vortragende und die Studierenden konnten praktisch ohne Installation und ohne Ortswechsel ihre Laptops einschalten Kameras und Headsets einstecken, die Verbindung zu den anderen Teilnehmern per Mausklick aufnehmen und die Vorlesung konnte starten.
					</p>
					
					<p>
					<img src="../img/pdf.gif" alt="pdf" /><a href="../musical.pdf" target="_blank"> den kompletten Abschlussbericht downloaden</a> [252 kB]
					</p>
					
					<p>
					<a href="alt_musical.html">nach oben</a>
					</p>
<!--***********************************************************************************************************-->
<!--***********************************************************************************************************-->				
				
			
			</div><!--content-->
		</div><!--main_right-->

<div class="footer">
			
			<div class="left"></div>
			<div class="right">FHTW Berlin, Allee der Kosmonauten 20-22, 10315 Berlin - <a href="../impressum.html">Impressum</a></div>
	</div><!--footer-->

</div><!--main-->

</body>
</html>