<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>

<meta http-equiv="content-type" content="text/html; charset=iso-8859-1" />
<meta name="description" content="description" />
<meta name="keywords" content="keywords" />
<meta name="author" content="author" />
<meta http-equiv="content-type" content="text/html; charset=iso-8859-1" />
<meta name="description" content="description" />
<meta name="keywords" content="keywords" />
<meta name="author" content="author" />

<link rel="Stylesheet" href="../css/style.css" type="text/css" media="screen" />
<link rel="Stylesheet" href="../css/projekte.css" type="text/css" media="screen" />


<title>Kompetenzfeld Media, Netze und Mobile Computing</title>

</head>
                                                         
<body>

<div class="main">

	<div class="main_left">
			<div class="link_menu">
				<a href="../index.html" accesskey="1">Home</a>
				<a href="../aktivitaeten.html" accesskey="6">Unsere Aktivit&auml;ten</a>
				<a href="../projekte.html" accesskey="4">Projekte</a>
				<a href="../publikationen.html" accesskey="4">Publikationen und Vortr&auml;ge</a>
				<a href="../team.html" accesskey="7">Das Team</a>
				<a href="../impressum.html" accesskey="3">Impressum</a>
			</div><!--link_menu-->
	
			<div class="logo"></div>
			
			<div class="Sprache">
				<a href="../en/Projekte/alt_blended_elearning.html"><img src="../img/englisch.gif" border="0" width="16" height="11"></a>
				<a href="alt_blended_elearning.html"><img src="../img/deutsch.gif" border="0"  width="16" height="11"></a>
			</div>
			
			<div class="subnavi">

				<div class="lbl">Laufende Projekte</div>

					<ul class="menu_2">
						<li>
							<a href="../projekte.html">
							<strong class="h2">Infrastruktur-/ Forschungsprojekte</strong><br />
							<strong class="h3">durch Drittmittel gef&ouml;rderte Projekte</strong>
							</a>
						</li>
						<li>
							<a href="kurse.html">
							<strong class="h2">Aus- und Weiterbildungskurse</strong><br />
							<strong class="h3">durch Drittmittel gef&ouml;rderte Kurse</strong>
							</a>
						</li>
						<li>
							<a href="zusammenarbeit.html">
							<strong class="h2">Zusammenarbeit</strong><br />
							<strong class="h3">Interdisziplin&auml;re Zusammenarbeit</strong>
							</a>
						</li>
					</ul>
					
				<div class="lbl">Abgeschlossene Projekte</div>
					
					<ul class="menu_2">	 
						 <li>
							<a href="alte_Projekte.html">
							<strong class="h2">Abgeschlossene Projekte</strong><br />
							<strong class="h3">&auml;ltere Projekte und Kurse</strong>
							</a>
						</li>
					</ul>
 			 </div><!--subnavi-->
 		</div><!--main_left-->


		<div class="main_right">

			<div class="header" style="background-image: url('../img/header_projekte.jpg')">
			</div>

			<div class="content">
				<h1>Abgeschlossene Projekte und Kurse</h1>
				
				<div class="descr">Abgeschlossene Projekte/ Kurse mit Unterst&uuml;tzung durch Fremdmittel</div>
				
				<div class="spacer_big"></div>
							
<!--***********************************************************************************************************-->
<!--***********************************************************************************************************-->
					
					<a href="alte_Projekte.html">&lt;zur&uuml;ck zur &Uuml;bersicht</a>	
					<h2>Blended Elearning-Kurs Audio Videotechnik (ESF Projekt)</h2>
					
					<h3>Zielstellung</h3>
										
					<p>
						Es sollte ein Internet-basierter Kurs entwickelt und durchf&uuml;hrt werden, der es den Teilnehmern erm&uuml;glich, moderne digitale Audio und Videotechniken zu verstehen und anzuwenden. Die Teilnehmer sollten in die Lage versetzt werden, mit Hilfe der erlernten Techniken flexibel und kompetent auf die neuen Anforderungen der Mediengesellschaft zu reagieren. Die &uuml;bermittlung der Lehrinhalte sollte einem blended learning Konzept folgend zu einem &uuml;berwiegenden Teil internet-gest&uuml;tzt asynchron und synchron erfolgen, d.h. die Teilnehmer sollen die Lehreinheiten asynchron in ihrem Betrieb oder zuhause &uuml;ber Internet abrufen k&ouml;nnen sich in den Pr&auml;senzveranstaltungen aktiv beteiligen.
					</p>
					<p>
Die physischen Pr&auml;senzzeiten an der Hochschule soll unter Ber&uuml;cksichtigung der m&ouml;glichen Berufst&auml;tigkeit der Teilnehmer gering gehalten werden. Pr&auml;senzpflicht an der Hochschule war allein f&uuml;r die gemeinsame Abschlusspr&auml;sentation/Leistungskontrolle der Projekte vorgesehen.
					</p>

					<h3>Durchf&uuml;hrung</h3>
					
					<p>
						Die Durchf&uuml;hrung des Projektes war unterteilt in eine Entwicklungs- und eine Durchf&uuml;hrungsphase.
					</p>	
					
					<p>
						In der Entwicklungsphase wurden die Lehr- und Lernmaterialien erstellt. Die 8 theoretischen Lehreinheiten zu je 2 Zeiteinheiten wurden definiert und mit dem Makromedia-Editor "Dreamweaver" geschrieben Animationen und Bildmaterial angereichert so dass sie als  HTML Material abrufbar ins Intranet gestellt werden konnte.
					</p>
					
					<p>
						Die Entwicklungsphase gliederte sich in einen theoretischen Teil von 16 Einheiten, in denen Grundlagenwissen vermittelt wird. Das heiﬂt es wurden je zwei Einheiten mit den folgenden Themen erstellt:
					</p>
					
					<ul>
						<li>Grundlagen digitale Bildmodelle, Digitalisierung</li>
						<li>Bildwahrnehmung (Grundlagen Licht und Farbe)</li>
						<li>Farbmodelle</li>
						<li>Digitale Bildbearbeitung</li>
						<li>Bildkompression (verlustlos, verlustbehaftet)</li>
						<li>Video Kodierung</li>
						<li>Grundlagen Audiotechnik</li>
						<li>Audiokomprimierung</li>
					</ul>
					
					<p>
						Nach Erstellung der HTML Materialien wurden die Lehreinheiten noch zus&auml;tzlich als Audio/Videovorlesungen produziert wobei die HTML-Materialien dynamisch mit einer speziell entwickelten Software digital mit aufgezeichnet wurden. Dies macht die spezifische Besonderheit des Kurses aus. Auf diese Weise konnte das Material in dreifacher Form bereitgestellt werden: als reines HTLM Dokument, als Audiostrom kombiniert mit den dynamischer Textdokument und als Audio/ Videostrom  kombiniert mit den dynamischer Textdokument..
					</p>
					
					<p>
						Dies erm&ouml;glicht es den Nutzern das Material je nach Bedarf und verf&uuml;gbarer Bandbreitem Internet zur Verf&uuml;gung zu stellen.
					</p>
					
					<p>
						Der Zugang zu den Internetmaterialien erfolgte &uuml;ber eine eigens daf&uuml;r eingerichtete Internetplattform, die sowohl als Zugangskontrolle als auch eine Chat-Plattform f&uuml;r die Teilnehmer diente, die auch ausgiebig benutzt wurde. Neben den theoretischen Materialien wurden auch zahlreiche zus&auml;tzliche praktische Anleitungen und Informationen zur in den praktischen &uuml;bungen benutzten Schnittsoftware &quot;Adobe-Premiere&quot; auf der Plattform bereitgestellt.
					</p>
					
					<p>
						Nachdem die  Materialien produziert waren, erfolgte die Durchf&uuml;hrungsphase 
Diese bestand aus der Pr&auml;sentation des theoretischen Materials das neben der Bereitstellung im Netz auch in Pr&auml;senzsitzungen vorgetragen wurde und aus
aus praktischen &uuml;bungen von insgesamt 16 Einheiten in denen das erlernte Wissen  umgesetzt und angewandt wurde. Das heiﬂt es wurden der Umgang mit digitalen/analogen Kameras oder anderen Video/Audioquellen, ebenso Digitalisieren, Schneiden, Modifizieren und Zusammenf&uuml;gen der Audio/Video Signale in einem Computer zu einem zusammenh&auml;ngenden Videoclip erlernt.
					</p>
					
					<p>
						Es fanden bisher 4 Kurse in der Zeit von 2002 -2004 statt mit durchschnittlich 15 Teilnehmern. Ein weiterer freifinanzierter Kurs ist geplant. 
Die Akzeptanz der Veranstaltung und des Materials durch die Teilnehmer war ausnehmend sehr gut wie die Evaluationsb&ouml;gen zeigen.
					</p>
					
					<p>
					<img src="../img/pdf.gif" alt="pdf" /><a href="../blended-elearning.pdf" target="_blank"> den kompletten Abschlussbericht downloaden</a> [64 kB]
					</p>
					
					<p>
					<a href="alt_blended_elearning.html">nach oben</a>
					</p>
<!--***********************************************************************************************************-->
<!--***********************************************************************************************************-->				
				
			
			</div><!--content-->
		</div><!--main_right-->

<div class="footer">
			
			<div class="left"></div>
			<div class="right">FHTW Berlin, Allee der Kosmonauten 20-22, 10315 Berlin - <a href="../impressum.html">Impressum</a></div>
	</div><!--footer-->

</div><!--main-->

</body>
</html>